#  <center> HOTEL RESERVATION ANALYSIS </center>

### Importing the csv using pandas file and connect to sqlite db in python

In [1]:
import pandas as pd
import sqlite3

In [2]:
data = pd.read_csv('D:/Education/Mentorness/Data Analyst Internship MIP-DA-04-20240316T195245Z-001/Data Analyst Internship MIP-DA-04/Project 1 Hotel reservation Analysis using SQL/Hotel Reservation Dataset.csv')

In [3]:
conn = sqlite3.connect('data.db')

In [4]:
data.to_sql('my_table', conn, if_exists='replace', index=False)

700

In [5]:
pd.read_sql_query('''SELECT * 
                     FROM my_table 
                     LIMIT 10''',conn)

,Booking_ID,no_of_adults,no_of_children,no_of_weekend_nights,no_of_week_nights,type_of_meal_plan,room_type_reserved,lead_time,arrival_date,market_segment_type,avg_price_per_room,booking_status
0,INN00001,2,0,1,2,Meal Plan 1,Room_Type 1,224,02-10-2017,Offline,65.00,Not_Canceled
1,INN00002,2,0,2,3,Not Selected,Room_Type 1,5,06-11-2018,Online,106.68,Not_Canceled
2,INN00003,1,0,2,1,Meal Plan 1,Room_Type 1,1,28-02-2018,Online,60.00,Canceled
3,INN00004,2,0,0,2,Meal Plan 1,Room_Type 1,211,20-05-2018,Online,100.00,Canceled
4,INN00005,2,0,1,1,Not Selected,Room_Type 1,48,11-04-2018,Online,94.50,Canceled
5,INN00006,2,0,0,2,Meal Plan 2,Room_Type 1,346,13-09-2018,Online,115.00,Canceled
6,INN00007,2,0,1,3,Meal Plan 1,Room_Type 1,34,15-10-2017,Online,107.55,Not_Canceled
7,INN00008,2,0,1,3,Meal Plan 1,Room_Type 4,83,26-12-2018,Online,105.61,Not_Canceled
8,INN00009,3,0,0,4,Meal Plan 1,Room_Type 1,121,06-07-2018,Offline,96.90,Not_Canceled
9,INN00010,2,0,0,5,Meal Plan 1,Room_Type 4,44,18-10-2018,Online,133.44,Not_Canceled

### 1. What is the total number of reservations in the dataset?

In [6]:
pd.read_sql_query('''SELECT COUNT(*) AS Total_reservations
                     FROM my_table''', conn)

   Total_reservations
0                 700

### 2. Which meal plan is the most popular among guests?

In [7]:
pd.read_sql_query('''SELECT type_of_meal_plan,COUNT(*) AS total_reservations
                     FROM my_table 
                     GROUP BY 1 
                     ORDER BY 2 DESC''', conn)

  type_of_meal_plan  total_reservations
0       Meal Plan 1                 527
1      Not Selected                 109
2       Meal Plan 2                  64

Meal Plan 1 is the most popular among guests

### 3. What is the average price per room for reservations involving children?

In [8]:
pd.read_sql_query('''SELECT AVG(avg_price_per_room) AS Average_per_room_with_children
                     FROM my_table
                     WHERE no_of_children <> 0 ''', conn)

   Average_per_room_with_children
0                      144.568333

### 4. How many reservations were made for the year 2018?

In [9]:
pd.read_sql_query("SELECT COUNT(*) AS No_reservations_made_2018 FROM my_table WHERE arrival_date LIKE '%2018' ", conn)

   No_reservations_made_2018
0                        577

### 5. What is the most commonly booked room type?

In [10]:
pd.read_sql_query('''SELECT room_type_reserved,COUNT(*) AS total_reservations
                     FROM my_table 
                     GROUP BY 1 
                     ORDER BY 2 DESC''', conn)

  room_type_reserved  total_reservations
0        Room_Type 1                 534
1        Room_Type 4                 130
2        Room_Type 6                  18
3        Room_Type 2                   8
4        Room_Type 7                   6
5        Room_Type 5                   4

Room_Type 1 is the most commonly booked room type

### 6. How many reservations fall on a weekend (no_of_weekend_nights > 0)?

In [11]:
pd.read_sql_query('''SELECT COUNT(*) AS no_reservations_weekend 
                     FROM my_table 
                     WHERE no_of_weekend_nights > 0''', conn)

   no_reservations_weekend
0                      383

### 7. What is the highest and lowest lead time for reservations?

In [12]:
pd.read_sql_query('''SELECT MAX(lead_time) AS Highest_lead_time, MIN(lead_time) AS lowest_lead_time 
                     FROM my_table''', conn)

   Highest_lead_time  lowest_lead_time
0                443                 0

### 8. What is the most common market segment type for reservations?

In [13]:
pd.read_sql_query('''SELECT market_segment_type,COUNT(*) AS No_reservations_for_each_segment_type
                     FROM my_table 
                     GROUP BY 1 
                     ORDER BY 2 DESC''', conn)

  market_segment_type  No_reservations_for_each_segment_type
0              Online                                    518
1             Offline                                    140
2           Corporate                                     27
3       Complementary                                     14
4            Aviation                                      1

Online is the most common one

### 9. How many reservations have a booking status of "Confirmed"?

In [14]:
pd.read_sql_query('''SELECT COUNT(*) AS no_reservations_confirmed 
                     FROM my_table 
                     WHERE booking_status = 'Not_Canceled' ''', conn)

   no_reservations_confirmed
0                        493

### 10. What is the total number of adults and children across all reservations?

In [15]:
pd.read_sql_query('''SELECT SUM(no_of_adults + no_of_children) AS total_number_people 
                     FROM my_table''', conn)

   total_number_people
0                 1385

### 11. What is the average number of weekend nights for reservations involving children?

In [16]:
pd.read_sql_query('''SELECT AVG(no_of_weekend_nights) AS Avg_number_weekend_nights
                     FROM my_table 
                     WHERE no_of_children > 0''', conn)

   Avg_number_weekend_nights
0                        1.0

### 12. How many reservations were made in each month of the year?

In [17]:
pd.read_sql_query('''SELECT SUBSTR(arrival_date,4,2) AS Month, COUNT(*) AS Total_reservations_each_month
                     FROM my_table 
                     GROUP BY 1''', conn)

   Month  Total_reservations_each_month
0     01                             11
1     02                             28
2     03                             52
3     04                             67
4     05                             55
5     06                             84
6     07                             44
7     08                             70
8     09                             80
9     10                            103
10    11                             54
11    12                             52

### 13. What is the average number of nights (both weekend and weekday) spent by guests for each room type?

In [18]:
pd.read_sql_query(''' SELECT room_type_reserved,
                            ROUND(AVG(no_of_weekend_nights + no_of_week_nights),2) AS Average_number_nights
                     FROM my_table 
                     GROUP BY 1 
                     ORDER BY 2 DESC''', conn)

  room_type_reserved  Average_number_nights
0        Room_Type 4                   3.80
1        Room_Type 6                   3.61
2        Room_Type 2                   3.00
3        Room_Type 1                   2.88
4        Room_Type 7                   2.67
5        Room_Type 5                   2.50

### 14. For reservations involving children, what is the most common room type, and what is the average price for that room type?

In [19]:
pd.read_sql_query('''SELECT room_type_reserved,COUNT(*) AS total_reservations,
                            ROUND(AVG(avg_price_per_room),2) AS Average_price_per_room_having_children
                     FROM my_table
                     WHERE no_of_children > 0 
                     GROUP BY 1 
                     ORDER BY 2 DESC 
                     LIMIT 1 ''', conn)

,room_type_reserved,total_reservations,Average_price_per_room_having_children
0,Room_Type 1,24,123.12

### 15. Find the market segment type that generates the highest average price per room.

In [20]:
pd.read_sql_query('''SELECT market_segment_type,
                            ROUND(AVG(avg_price_per_room),2) AS Average_price_per_room_
                     FROM my_table
                     GROUP BY 1 
                     ORDER BY 2 DESC 
                     LIMIT 1 ''', conn)

  market_segment_type  Average_price_per_room_
0              Online                   112.46